{
  "backend/main.mo": "Defines the main canister actor and a large Types module containing data structures for technologies, devices, components, and related game entities. Includes storage mixins and migration support.",
  "backend/migration.mo": "Contains old type definitions and structures used for upgrading canister state and migrating persisted data. Provides compatibility mappings for legacy saved-game formats.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of numerous frontend files for documentation or build tooling.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, configuring colors and layout tokens.",
  "frontend/index.html": "Minimal HTML entry point mounting the SPA root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up the React router, main layout, and page routes for the application with theme support and global toasts.",
  "frontend/src/components/auth/LoginButton.tsx": "Implements a login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting for user name and saving a new profile via mutation with basic validation and toasts.",
  "frontend/src/components/layout/GameLayout.tsx": "Layout wrapper that shows navigation, page content, and triggers profile setup modal when no profile exists.",
  "frontend/src/components/nav/MainNav.tsx": "Top navigation bar showing company branding, route links, and login state with user greeting.",
  "frontend/src/features/branding/LogoCreator.tsx": "Interactive form for generating and customizing SVG logos with configurable text, colors, and shapes.",
  "frontend/src/features/branding/logoFallback.ts": "Generates fallback initials and SVG logo when no custom logo exists.",
  "frontend/src/features/branding/logoGenerator.ts": "Builds SVG logos from configuration including shapes, gradients, and initials; defines default config.",
  "frontend/src/features/branding/LogoRenderer.tsx": "Displays a provided SVG logo or generates a fallback based on name and renders it using innerHTML.",
  "frontend/src/features/cloud-saves/SaveSlotsPanel.tsx": "UI panel for creating, loading, and renaming cloud save slots, integrating game state and toasts.",
  "frontend/src/features/competitors/CompetitorList.tsx": "Displays competitor cards with stats like cash, market share, and strength.",
  "frontend/src/features/competitors/competitorModel.ts": "Zustand store managing competitor list with initialization and update methods.",
  "frontend/src/features/dashboard/bestProductScoring.ts": "Provides utilities for categorizing products, scoring them, filtering by year/category, and determining yearly winners.",
  "frontend/src/features/dashboard/BestProductsOfYearPanel.tsx": "Displays yearly best products per category, allowing year selection and showing winners with scores and logos.",
  "frontend/src/features/dashboard/MetricsPanel.tsx": "Renders static business metrics with trend indicators and a progress bar for R&D.",
  "frontend/src/features/dashboard/releasedProductModel.ts": "Creates released product objects from blueprint data and exposes helpers for category extraction and logo retrieval.",
  "frontend/src/features/device-studio/BlueprintList.tsx": "Lists device blueprints with key specs and supports releasing them or opening them for editing.",
  "frontend/src/features/device-studio/designCatalog.ts": "Defines available design presets per device category with names, styles, and icons.",
  "frontend/src/features/device-studio/DesignPicker.tsx": "Shows selectable design options for a device category with a preview and design metadata.",
  "frontend/src/features/device-studio/deviceBlueprintAdapters.ts": "Generates a default device blueprint object with preset hardware and feature fields.",
  "frontend/src/features/device-studio/DeviceBlueprintEditor.tsx": "Form-based editor to create device blueprints, handling fields, validation, and save actions.",
  "frontend/src/features/investments/InvestmentsActionsPanel.tsx": "UI panel for performing investments such as store building, acquisitions, marketing, and recruitment with validation and cash updates.",
  "frontend/src/features/investments/InvestmentsLog.tsx": "Displays a scrollable history of past investments with icons, amounts, descriptions, and timestamps.",
  "frontend/src/features/investments/investmentStore.ts": "Zustand store managing a persisted list of investments with an addInvestment method that prepends capped entries.",
  "frontend/src/features/market/MarketFeed.tsx": "Shows a scrollable feed of market events with icons, titles, descriptions, and impact details.",
  "frontend/src/features/market/marketFeedStore.ts": "Zustand store for market events with an addEvent method that prepends capped entries.",
  "frontend/src/features/new-game/difficultyPresets.ts": "Defines starting cash and difficulty modifiers for normal and challenging game modes.",
  "frontend/src/features/new-game/NewGameModal.tsx": "Modal for creating a new game, selecting difficulty, entering company branding, and initializing game state.",
  "frontend/src/features/office/Office3DViewer.tsx": "Renders a 3D office scene using react-three-fiber based on current office level.",
  "frontend/src/features/office/officeScenePresets.ts": "Provides preset 3D scene configurations for office levels including lighting, floor colors, and furniture.",
  "frontend/src/features/office/officeStore.ts": "Zustand store tracking office level and upgrade cost with logic to increase both on upgrade.",
  "frontend/src/features/office/OfficeUpgradePanel.tsx": "UI panel showing office level stats and allowing upgrades if the player has enough cash.",
  "frontend/src/features/products/releaseModifiers.ts": "Utility functions applying productivity and attraction modifiers to cost, sales, and rating.",
  "frontend/src/features/products/ReleaseProductModal.tsx": "Modal for configuring and releasing a product, calculating costs, bonuses, and creating a released product record.",
  "frontend/src/features/research/ResearchDetailsPanel.tsx": "Displays detailed research info and allows starting research if requirements are met and funds are available.",
  "frontend/src/features/research/ResearchList.tsx": "Searchable, filterable list of technologies that opens a detail panel for selected items.",
  "frontend/src/features/research/techDataset.ts": "Generates a large mock dataset of technology entries with categories, effects, costs, and requirements.",
  "frontend/src/features/simulation/simulationEngine.ts": "Zustand-powered simulation loop that advances days, initializes competitors, and triggers random market events.",
  "frontend/src/features/stores/storeNetworkModel.ts": "Defines store network data, creation helpers, bonuses, validation, and store-building utilities.",
  "frontend/src/features/stores/storeNetworkStore.ts": "Zustand store managing the store network state, persistence, and store-building actions.",
  "frontend/src/features/stores/StoreNetworkSummaryPanel.tsx": "Panel summarizing store network counts, bonuses, and store locations.",
  "frontend/src/features/stores/StoresBuildCard.tsx": "UI card to select a country and build a store, showing costs and bonuses.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actors with identity-based refetching using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for backend operations like profiles, blueprints, technologies, research, and saves.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity provider.",
  "frontend/src/pages/CloudSavesPage.tsx": "Cloud saves UI requiring authentication and showing save slots or login prompt.",
  "frontend/src/pages/CompetitorsMarketPage.tsx": "Page displaying competitor list and market feed within tabbed navigation.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing game metrics, simulation controls, store summary, and product stats.",
  "frontend/src/pages/DeviceStudioPage.tsx": "Provides a tabbed interface for editing and listing device blueprints with selectable blueprint IDs.",
  "frontend/src/pages/InvestmentsPage.tsx": "Displays investment actions, store network summary, and an investments log in a three-column layout.",
  "frontend/src/pages/OfficePage.tsx": "Shows office upgrades and a 3D office viewer in a split layout with a header.",
  "frontend/src/pages/ResearchPage.tsx": "Renders the research page header and a list of available research items.",
  "frontend/src/state/gameState.ts": "Zustand store managing game state, released products, branding, and related update/reset helpers with persistence.",
  "frontend/src/state/saveGameStore.ts": "Zustand store for current save ID and local store network with persistence and reset support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project metadata describing the game’s features, state, versioning, and tracked requirements."
}