{
  "backend/main.mo": "Defines a large set of backend types for technologies, device components, and research status inside a Motoko actor.",
  "feature_evidence.json": "Lists implemented game features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summary describing office scene preset configurations for different level ranges.",
  "frontend/index.css": "Configures Tailwind base styles and theme variables for light and dark mode.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the main router, theme provider, and page routes for core game sections.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to enter their name and create a profile via mutation.",
  "frontend/src/components/layout/GameLayout.tsx": "Wraps all pages with navigation and conditionally shows the profile setup modal.",
  "frontend/src/components/nav/MainNav.tsx": "Renders the main navigation bar with links, icons, welcome text, and authentication controls.",
  "frontend/src/features/cloud-saves/SaveSlotsPanel.tsx": "UI panel to view, create, load, rename, and delete cloud save slots using query hooks and dialogs.",
  "frontend/src/features/competitors/CompetitorList.tsx": "Displays competitor cards showing strategy, stats, and strength progress from the competitor store.",
  "frontend/src/features/competitors/competitorModel.ts": "Zustand store managing competitor data with initialization and update helpers.",
  "frontend/src/features/dashboard/MetricsPanel.tsx": "Renders static dashboard metric cards with values, trends, and optional progress bars.",
  "frontend/src/features/device-studio/BlueprintList.tsx": "Lists device blueprints with key specs and provides release and edit actions.",
  "frontend/src/features/device-studio/designCatalog.ts": "Static catalog mapping device categories to available design definitions.",
  "frontend/src/features/device-studio/DesignPicker.tsx": "Shows available design options for a category and lets the user select a design visually.",
  "frontend/src/features/device-studio/deviceBlueprintAdapters.ts": "Provides a default device blueprint factory with all fields initialized.",
  "frontend/src/features/device-studio/DeviceBlueprintEditor.tsx": "Form-based editor to create device blueprints using default templates and save via API.",
  "frontend/src/features/investments/InvestmentsActionsPanel.tsx": "UI panel for creating investments like acquisitions, marketing, and recruitment, updating cash and logging investments.",
  "frontend/src/features/investments/InvestmentsLog.tsx": "Displays a scrollable history of past investments with icons, amounts, descriptions, and timestamps.",
  "frontend/src/features/investments/investmentStore.ts": "Zustand store persisting up to 100 investment records and providing an addInvestment method.",
  "frontend/src/features/market/MarketFeed.tsx": "Scrollable UI feed showing recent market events with icons, descriptions, and day labels.",
  "frontend/src/features/market/marketFeedStore.ts": "Zustand store for market events, allowing adding new events and keeping the latest 100.",
  "frontend/src/features/new-game/difficultyPresets.ts": "Defines starting values and modifiers for normal and challenging game difficulties.",
  "frontend/src/features/new-game/NewGameModal.tsx": "Modal to start a new game by selecting a difficulty preset and initializing game state.",
  "frontend/src/features/office/Office3DViewer.tsx": "3D office viewer using React Three Fiber that renders furniture based on office level.",
  "frontend/src/features/office/officeScenePresets.ts": "Preset lighting and furniture layouts for different office level ranges used by the 3D viewer.",
  "frontend/src/features/office/officeStore.ts": "Zustand store managing office level and upgrade cost, with logic for leveling up to a max of 20.",
  "frontend/src/features/office/OfficeUpgradePanel.tsx": "Panel showing office level, stats, upgrade cost, and a button to perform upgrades if affordable.",
  "frontend/src/features/products/ReleaseProductModal.tsx": "Modal for configuring and releasing a product, calculating total cost and updating game state cash.",
  "frontend/src/features/research/ResearchDetailsPanel.tsx": "Panel displaying technology details, prerequisites, and allows starting research if conditions are met.",
  "frontend/src/features/research/ResearchList.tsx": "Lists technologies with search and category filtering and opens details panel for a selected item.",
  "frontend/src/features/research/techDataset.ts": "Generates a large mock dataset of technologies with categories, effects, costs, and requirements.",
  "frontend/src/features/simulation/simulationEngine.ts": "Manages simulation loop that advances days, triggers competitor events, and updates market and competitor state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, managing login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor API calls for user profiles, blueprints, technologies, research, and save slots with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for light and dark themes and global styling rules.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers and mounts the root component.",
  "frontend/src/pages/CloudSavesPage.tsx": "Cloud saves page showing login prompt or save slots panel based on authentication.",
  "frontend/src/pages/CompetitorsMarketPage.tsx": "Page displaying competitor list and market feed via tabbed interface.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing game metrics, simulation controls, and summary cards.",
  "frontend/src/pages/DeviceStudioPage.tsx": "Device studio page with tabs for editing and listing device blueprints.",
  "frontend/src/pages/InvestmentsPage.tsx": "Investments page combining action panel and investment log.",
  "frontend/src/pages/OfficePage.tsx": "Office management page showing upgrade panel and 3D viewer.",
  "frontend/src/pages/ResearchPage.tsx": "Research page listing available technologies to unlock.",
  "frontend/src/state/gameState.ts": "Zustand store persisting game state with helpers to update cash, techs, and products.",
  "frontend/src/state/saveGameStore.ts": "Zustand store for active save ID and local save data with persistence.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind config defining content paths, dark mode, extended theme tokens, custom animations, and typography/container/animate plugins.",
  "project_state.json": "Project metadata describing a business-simulator game, its features list, required images, and current project state version."
}