{
  "backend/main.mo": "Actor defining numerous device- and research-related types while including storage and authorization mixins.",
  "feature_evidence.json": "Report mapping implemented features to affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend files and their recent feature updates.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the React router, routes, theme provider, and global toaster inside the main app component.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter a name and create their profile.",
  "frontend/src/components/layout/GameLayout.tsx": "Layout wrapper with navigation, page container, and conditional profile‑setup modal display.",
  "frontend/src/components/layout/PageHeader.tsx": "Reusable page header showing an icon, title, subtitle, and optional action elements.",
  "frontend/src/components/nav/MainNav.tsx": "Renders the main navigation bar with desktop and mobile support, showing company branding, nav links, and user login state.",
  "frontend/src/components/nav/MobileNavPanel.tsx": "Provides a slide-in mobile navigation panel listing routes and highlighting the active path.",
  "frontend/src/features/branding/LogoCreator.tsx": "Interactive form for generating and customizing SVG logos based on text, shape, and colors.",
  "frontend/src/features/branding/logoFallback.ts": "Generates fallback SVG logos using initials when no custom logo is provided.",
  "frontend/src/features/branding/logoGenerator.ts": "Creates SVG logos with configurable shapes, gradients, and initials; provides defaults and helper utilities.",
  "frontend/src/features/branding/LogoRenderer.tsx": "Displays a provided SVG logo or falls back to an auto-generated initials-based SVG.",
  "frontend/src/features/cloud-saves/SaveSlotsPanel.tsx": "Manages save slots allowing creation, loading, and renaming of game saves with dialogs and validation.",
  "frontend/src/features/competitors/CompetitorList.tsx": "Displays a grid of competitor cards showing stats like cash, market share, products, and strength.",
  "frontend/src/features/competitors/competitorModel.ts": "Zustand store defining competitor data, initialization based on difficulty, and update helpers.",
  "frontend/src/features/dashboard/bestProductScoring.ts": "Provides functions to filter products, calculate scores, determine best products, and list available release years.",
  "frontend/src/features/dashboard/BestProductsOfYearPanel.tsx": "Displays yearly best products by category, allowing year selection and showing top-scoring winners with logos and scores.",
  "frontend/src/features/dashboard/MetricsPanel.tsx": "Shows static business metrics in a grid with trend indicators and a progress bar for R&D.",
  "frontend/src/features/dashboard/releasedProductModel.ts": "Creates released product records, extracts category and features, and retrieves product logos based on blueprint metadata.",
  "frontend/src/features/device-studio/BlueprintList.tsx": "Lists all device blueprints with key specs and category badges, allowing editing and product release actions.",
  "frontend/src/features/device-studio/designCatalog.ts": "Defines available design options per device category with names, styles, and icons.",
  "frontend/src/features/device-studio/DesignPicker.tsx": "Shows available designs for a device category and lets users select one with visual previews.",
  "frontend/src/features/device-studio/deviceBlueprintAdapters.ts": "Defines a factory function that returns a fully populated default DeviceBlueprint object with preset hardware and connection fields.",
  "frontend/src/features/device-studio/DeviceBlueprintEditor.tsx": "Form for creating or editing device blueprints with foldable and premium feature handling.",
  "frontend/src/features/investments/InvestmentsActionsPanel.tsx": "UI panel for performing investments and building stores, handling cash validation, state updates, and triggering toast notifications.",
  "frontend/src/features/investments/InvestmentsLog.tsx": "Displays a scrollable history of past investments with icons, amounts, descriptions, and timestamps.",
  "frontend/src/features/investments/investmentStore.ts": "Zustand store managing an investment list with persistence and a method to append new investment entries.",
  "frontend/src/features/market/MarketFeed.tsx": "Renders a scrollable feed of market events with icons, badges, descriptions, and formatted day labels.",
  "frontend/src/features/market/marketFeedStore.ts": "Zustand store for market events, allowing new events to be added and storing up to 100 entries.",
  "frontend/src/features/new-game/difficultyPresets.ts": "Defines difficulty presets specifying starting cash and gameplay modifiers for normal and challenging modes.",
  "frontend/src/features/new-game/NewGameModal.tsx": "Modal for starting a new game, collecting company info, choosing difficulty, and initializing game state.",
  "frontend/src/features/office/Office3DViewer.tsx": "3D office viewer using react-three-fiber, rendering an animated office scene based on level presets and decor.",
  "frontend/src/features/office/officeAnimations.ts": "Provides small animation helper functions for flicker, light pulsing, and plant sway.",
  "frontend/src/features/office/officeArchitecture.tsx": "Renders the 3D office room shell with walls, floor, window, and door materials based on decor settings.",
  "frontend/src/features/office/officeDecorOptions.ts": "Defines types and lists of available wall colors, wallpaper patterns, and wood floor styles with defaults.",
  "frontend/src/features/office/OfficeDecorPanel.tsx": "UI panel for selecting wall finishes, wallpaper patterns, and floor styles using the office store.",
  "frontend/src/features/office/officeDecorTextures.ts": "Generates procedural wallpaper and wood floor textures using canvas for Three.js materials.",
  "frontend/src/features/office/officeMaterials.ts": "Defines material presets, lighting and color palettes by level, and creates wall and floor materials.",
  "frontend/src/features/office/officeProps.tsx": "Defines React components rendering 3D desk, chair, and monitor models with customizable styles and positions.",
  "frontend/src/features/office/officeScenePresets.ts": "Provides preset office layouts for different level ranges, specifying floor sizes and prop placements.",
  "frontend/src/features/office/officeStore.ts": "Implements a persistent Zustand store managing office level, upgrade cost, and decor settings with update functions.",
  "frontend/src/features/office/OfficeUpgradePanel.tsx": "Displays office level, bonuses, upgrade cost, and handles upgrade actions with validation.",
  "frontend/src/features/products/releaseModifiers.ts": "Contains utility functions applying productivity and attraction bonuses to production cost, sales, and rating.",
  "frontend/src/features/products/ReleaseProductModal.tsx": "Renders a modal for releasing a product, handling pricing, cost calculations, validation, and product creation.",
  "frontend/src/features/research/ResearchDetailsPanel.tsx": "Displays detailed info about a research item and handles starting research with cost and prerequisite checks.",
  "frontend/src/features/research/ResearchList.tsx": "Lists research technologies with search and category filtering and opens a detail panel for selected items.",
  "frontend/src/features/research/techDataset.ts": "Generates a dataset of 3000 technology research items with categories, effects, pricing, and requirements.",
  "frontend/src/features/simulation/eraEventsDataset.ts": "Defines historical era events with dates and gameplay effects, providing a static chronological dataset.",
  "frontend/src/features/simulation/simulationEngine.ts": "Runs the day‑to‑day simulation loop, triggering era events, competitor actions, and updating game state.",
  "frontend/src/features/stores/storeNetworkModel.ts": "Defines store network constants and logic for bonuses, validation, and creating store entities.",
  "frontend/src/features/stores/storeNetworkStore.ts": "Zustand store managing store network state, including building stores and persistence.",
  "frontend/src/features/stores/StoreNetworkSummaryPanel.tsx": "UI panel showing store network totals, bonuses, and locations.",
  "frontend/src/features/stores/StoresBuildCard.tsx": "UI card allowing players to select a country and build a new store with displayed costs and bonuses.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on user identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data through an actor, covering user profiles, device data, technologies, research, and premium unlocks.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, applying global background and text styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CloudSavesPage.tsx": "Renders the cloud saves page, showing login prompts when unauthenticated or save slots when signed in.",
  "frontend/src/pages/CompetitorsMarketPage.tsx": "Displays competitor and market feed tabs with a shared page header.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the main dashboard with simulation controls, metrics, product stats, and company branding.",
  "frontend/src/pages/DeviceStudioPage.tsx": "Provides tabs for editing device blueprints and viewing the blueprint list, with selection state management.",
  "frontend/src/pages/InvestmentsPage.tsx": "Displays investment actions, store network summary, and an investments log.",
  "frontend/src/pages/OfficePage.tsx": "Shows office management panels for upgrades, decor, and a 3D office viewer.",
  "frontend/src/pages/ResearchPage.tsx": "Renders the research page with a header and a list of research items.",
  "frontend/src/state/gameState.ts": "Defines a persisted Zustand store holding game state, released products, branding, and event tracking with mutation helpers.",
  "frontend/src/state/saveGameStore.ts": "Zustand store defining current save ID and local store network with persistence and reset helpers.",
  "frontend/src/utils/gameCalendar.ts": "Utility for converting simulation days to Gregorian dates with leap-year logic and formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, and managing persisted parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, layout, and enabling plugins like typography and animations.",
  "project_state.json": "Project metadata describing versions, game scope, architecture notes, and existing implemented features."
}