{
  "kind": "build_request",
  "title": "Add country store expansion system that boosts productivity and product attraction",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Extend the saved game data model to include a player-built store network, where each store is tied to a specific country and contributes to two computed modifiers: (1) a productivity bonus and (2) a product attraction bonus; ensure this data round-trips correctly through Cloud Saves (create/load) and local persisted state.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "allow the user to build stores in countries to increase productivity and increase attraction for the product."
        ]
      },
      "acceptanceCriteria": [
        "A new store-network structure exists in the shared types so it can be stored inside a save slot and restored on load.",
        "Loading an older save (without store data) does not crash; missing store data defaults to an empty store list and zero/neutral modifiers.",
        "Creating a cloud save, then loading it, preserves the list of built stores and the derived modifiers."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add a \"Stores\" build action in the Investments area that lets the player select a country and build a store if they have enough cash, then records the action and updates game state accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "allow the user to build stores in countries to increase productivity and increase attraction for the product."
        ]
      },
      "acceptanceCriteria": [
        "The Investments screen includes a new card/panel to build a store with at least: country selection, displayed cost, and a \"Build Store\" action.",
        "Attempting to build a store with insufficient funds shows an error and does not change cash or store state.",
        "Building a store deducts cash, appends the store to the store network state, and adds an entry to the existing investments log.",
        "The UI prevents or clearly handles building a duplicate store in the same country (either disallow or treat as an upgrade level), and the behavior is consistent and persisted."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Expose the current store network and its effects in the UI by showing: number of stores, the list of countries with stores, and the current productivity and attraction bonuses on at least one primary management surface (Investments and/or Dashboard).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "allow the user to build stores in countries to increase productivity and increase attraction for the product."
        ]
      },
      "acceptanceCriteria": [
        "The player can see an up-to-date list of built store countries somewhere in the app without opening developer tools.",
        "The UI displays the computed productivity bonus and attraction bonus values derived from the store network.",
        "After building a store, the displayed list and bonus values update immediately."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Apply store-derived modifiers to the product release flow so that (a) productivity affects the effective production cost and/or production outcome and (b) attraction affects the released product’s resulting sales and/or rating calculation, in a deterministic, clearly communicated way in the Release Product modal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "allow the user to build stores in countries to increase productivity and increase attraction for the product."
        ]
      },
      "acceptanceCriteria": [
        "The Release Product modal shows how productivity and attraction are affecting the calculated totals/outcomes (e.g., shows a bonus line or adjusted totals).",
        "Releasing the same product inputs with more stores built results in a measurably better outcome (lower cost and/or higher sales/rating) than with zero stores, without requiring randomness.",
        "The release flow still validates cash correctly using the adjusted total cost, and does not allow releasing if the player cannot afford it."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "If changing stable/persisted backend state requires an upgrade path, add backend/migration.mo following the project’s conditional migration policy so existing deployed data is not lost.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Implementing a full geographic simulation (taxes, logistics, tariffs, shipping times, localization).",
    "Adding real-world map UI, geolocation, or third-party country APIs.",
    "Implementing hiring/workers (this request is only for stores).",
    "Adding new authentication methods beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}