{
  "kind": "build_request",
  "title": "Office 3D scene: add decor customization (wallpaper/wall color, wood floor) and architectural elements (windows + door)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-62",
      "text": "Add customizable office room finishes to the Office 3D scene: (1) wall color and/or wallpaper style, and (2) wooden floor style, and ensure these settings affect the materials used in the Office3DViewer scene rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes as well as wall color/wallpaper,floor wood and windows and a door"
        ]
      },
      "acceptanceCriteria": [
        "Office3DViewer no longer renders the floor as a single flat color only; it supports at least 3 distinct wood floor looks (e.g., light oak, walnut, dark stained) that are visually different.",
        "Office3DViewer supports both a solid wall color option and at least 2 wallpaper/pattern options that are visually distinct.",
        "Changing wall/floor finish settings updates the 3D scene deterministically and immediately (no refresh required).",
        "All finishes render correctly in both light and dark UI themes (no blown-out whites / unreadable near-black surfaces)."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Add architectural elements to the Office 3D scene: windows and a door, rendered as part of the office room shell (not as loose furniture props), with sizing/placement that adapts to the preset floor dimensions in officeScenePresets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes as well as wall color/wallpaper,floor wood and windows and a door"
        ]
      },
      "acceptanceCriteria": [
        "Office3DViewer shows at least one door and at least one window in the scene at every office level.",
        "Door and window placement scales/positions correctly as preset.floorSize changes (e.g., levels that use 8x8 vs 14x14 do not have floating or intersecting door/window geometry).",
        "Door/window materials participate in lighting (receive/cast shadows where appropriate) and do not introduce major z-fighting artifacts with walls.",
        "The new architectural meshes do not break OrbitControls interaction or cause runtime errors/warnings in the console during normal use."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Provide an Office customization UI on the Office Management page that lets the player choose the wall finish (color/wallpaper) and floor wood style, and persist these choices locally using the existing persisted office store.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes as well as wall color/wallpaper,floor wood and windows and a door"
        ]
      },
      "acceptanceCriteria": [
        "OfficePage includes a clearly labeled section (e.g., \"Office Decor\") with controls to select: wall finish (solid vs wallpaper) and floor wood style.",
        "Selections persist across page reloads via the existing office-storage persisted Zustand store (frontend/src/features/office/officeStore.ts).",
        "Defaults are sensible for new users (no empty/undefined material selections) and do not change existing office level progression behavior.",
        "User-facing labels for the decor controls are in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend unchanged; implement this request entirely in the frontend unless a backend change becomes strictly necessary.",
    "Preserve the existing office level progression logic and deterministic preset selection behavior in getOfficeScenePresetForLevel(level)."
  ],
  "nonGoals": [
    "Adding backend/cloud-save persistence for office decor settings (store locally only via the persisted office store).",
    "Adding new gameplay bonuses tied to wallpapers/flooring/windows/door.",
    "Adding external 3D model assets; use Three.js primitives/procedural geometry consistent with the current office props approach."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}