{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Country store expansion system (stores network, UI, and release modifiers)",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Persist a player-built country store network in local state and include it in cloud save create/load with safe defaults for older saves.",
      "acceptanceCriteria": [
        "A new store-network structure exists in the shared types so it can be stored inside a save slot and restored on load.",
        "Loading an older save (without store data) does not crash; missing store data defaults to an empty store list and zero/neutral modifiers.",
        "Creating a cloud save, then loading it, preserves the list of built stores and the derived modifiers."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/stores/storeNetworkModel.ts",
          "operation": "create",
          "description": "Create store-network domain helpers: define default empty StoreNetwork, a deterministic bonus computation (productivity + attraction) derived from the stores list, and helpers to add/validate a store for a given country."
        },
        {
          "path": "frontend/src/features/stores/storeNetworkStore.ts",
          "operation": "create",
          "description": "Create a persisted Zustand store for store network state (stores list + computed bonuses). Expose actions to initialize/replace from a loaded save and to build a store. Use the helpers from storeNetworkModel.ts."
        },
        {
          "path": "frontend/src/features/cloud-saves/SaveSlotsPanel.tsx",
          "operation": "modify",
          "description": "Include storeNetwork when creating a cloud save and restore it on load. When a loaded save has missing storeNetwork, initialize the store network store with an empty network and neutral modifiers to avoid crashes."
        },
        {
          "path": "frontend/src/state/saveGameStore.ts",
          "operation": "modify",
          "description": "Extend local persisted state to also record the currently loaded save's storeNetwork snapshot alongside existing local save data, ensuring local round-trip behavior even without cloud load (when applicable)."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add a Stores build action in Investments to select a country, validate funds/duplicates, build the store, deduct cash, and log the investment.",
      "acceptanceCriteria": [
        "The Investments screen includes a new card/panel to build a store with at least: country selection, displayed cost, and a \"Build Store\" action.",
        "Attempting to build a store with insufficient funds shows an error and does not change cash or store state.",
        "Building a store deducts cash, appends the store to the store network state, and adds an entry to the existing investments log.",
        "The UI prevents or clearly handles building a duplicate store in the same country (either disallow or treat as an upgrade level), and the behavior is consistent and persisted."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/stores/StoresBuildCard.tsx",
          "operation": "create",
          "description": "Create a new Investments action card for building stores. Use shadcn-ui components (Card, Button, Input/Label, and a country Select) to provide country selection, cost display, and a Build Store action. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/investments/InvestmentsActionsPanel.tsx",
          "operation": "modify",
          "description": "Wire the new StoresBuildCard into the Investments actions grid. Ensure the build handler checks cash, prevents or clearly handles duplicate country builds consistently (e.g., disallow duplicates with an error toast), deducts cash via useGameState.updateCash, updates store network via the storeNetwork store action, and logs via useInvestmentStore.addInvestment."
        },
        {
          "path": "frontend/src/features/investments/InvestmentsLog.tsx",
          "operation": "modify",
          "description": "Extend the log icon/type handling to support a new investment type for store building (e.g., 'stores' or 'store') so store build entries render consistently in the history."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Show the store network status and computed effects in the UI (store count, country list, productivity bonus, attraction bonus).",
      "acceptanceCriteria": [
        "The player can see an up-to-date list of built store countries somewhere in the app without opening developer tools.",
        "The UI displays the computed productivity bonus and attraction bonus values derived from the store network.",
        "After building a store, the displayed list and bonus values update immediately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/stores/StoreNetworkSummaryPanel.tsx",
          "operation": "create",
          "description": "Create a summary panel that reads from the storeNetwork store and displays: number of stores, list of countries with stores, and the computed productivity and attraction bonuses. Use shadcn-ui components (Card/Badge/Separator as needed). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/InvestmentsPage.tsx",
          "operation": "modify",
          "description": "Add the StoreNetworkSummaryPanel to the Investments page layout (e.g., near the actions or alongside the log) so players can always see store network status while making investment decisions."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Expose store network effects on a primary management surface by adding a small store summary card/panel (using StoreNetworkSummaryPanel or a compact variant) so bonuses are visible without navigating away."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Apply store-derived productivity and attraction modifiers to the Release Product flow with deterministic, clearly shown adjustments and correct affordability validation.",
      "acceptanceCriteria": [
        "The Release Product modal shows how productivity and attraction are affecting the calculated totals/outcomes (e.g., shows a bonus line or adjusted totals).",
        "Releasing the same product inputs with more stores built results in a measurably better outcome (lower cost and/or higher sales/rating) than with zero stores, without requiring randomness.",
        "The release flow still validates cash correctly using the adjusted total cost, and does not allow releasing if the player cannot afford it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/products/releaseModifiers.ts",
          "operation": "create",
          "description": "Create deterministic modifier utilities for the release flow: compute adjusted production cost from productivity bonus and adjusted sales/rating (or sales only) from attraction bonus. Keep the mapping simple, measurable, and explainable in UI."
        },
        {
          "path": "frontend/src/features/dashboard/releasedProductModel.ts",
          "operation": "modify",
          "description": "Update released product creation to accept optional modifier inputs (or accept already-adjusted inputs) so attraction can deterministically improve resulting sales and/or rating in a reproducible way."
        },
        {
          "path": "frontend/src/features/products/ReleaseProductModal.tsx",
          "operation": "modify",
          "description": "Read current store bonuses from the storeNetwork store and apply them to the release calculations. Show explicit lines for (a) productivity impact on production cost and adjusted total cost and (b) attraction impact on resulting sales/rating. Validate cash using the adjusted total cost and block release if unaffordable."
        }
      ]
    }
  ]
}