{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Office 3D decor customization and architectural shell elements (windows + door)",
  "requirements": [
    {
      "id": "REQ-62",
      "summary": "Add selectable wall finishes (solid color or wallpaper) and multiple wood floor looks that immediately update Office3DViewer materials.",
      "acceptanceCriteria": [
        "Office3DViewer no longer renders the floor as a single flat color only; it supports at least 3 distinct wood floor looks (e.g., light oak, walnut, dark stained) that are visually different.",
        "Office3DViewer supports both a solid wall color option and at least 2 wallpaper/pattern options that are visually distinct.",
        "Changing wall/floor finish settings updates the 3D scene deterministically and immediately (no refresh required).",
        "All finishes render correctly in both light and dark UI themes (no blown-out whites / unreadable near-black surfaces)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/office/officeDecorOptions.ts",
          "operation": "create",
          "description": "Define decor option enums/IDs and curated option lists for: wall solid colors, wallpaper patterns (>=2), and wood floor styles (>=3). Include display labels and safe default selections (no undefined)."
        },
        {
          "path": "frontend/src/features/office/officeDecorTextures.ts",
          "operation": "create",
          "description": "Implement procedural, deterministic Three.js texture helpers for wallpaper patterns and wood floor looks (e.g., CanvasTexture-based), including repeat/anisotropy settings to avoid blur and banding."
        },
        {
          "path": "frontend/src/features/office/officeMaterials.ts",
          "operation": "modify",
          "description": "Extend material/palette utilities to support decor-driven wall/floor materials (solid color and patterned wallpaper; multiple wood floor styles). Ensure roughness/metalness values remain readable under the existing lighting progression and both UI themes."
        },
        {
          "path": "frontend/src/features/office/Office3DViewer.tsx",
          "operation": "modify",
          "description": "Read wall/floor decor selections from the persisted office store and apply them to the room shell meshes using the new decor material/texture utilities so changes are immediate and deterministic (no reload)."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Render windows and a door as part of the office room shell with placement that scales with preset floor dimensions.",
      "acceptanceCriteria": [
        "Office3DViewer shows at least one door and at least one window in the scene at every office level.",
        "Door and window placement scales/positions correctly as preset.floorSize changes (e.g., levels that use 8x8 vs 14x14 do not have floating or intersecting door/window geometry).",
        "Door/window materials participate in lighting (receive/cast shadows where appropriate) and do not introduce major z-fighting artifacts with walls.",
        "The new architectural meshes do not break OrbitControls interaction or cause runtime errors/warnings in the console during normal use."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/office/officeArchitecture.tsx",
          "operation": "create",
          "description": "Create room-shell primitives that include: floor, 4 walls, plus integrated architectural elements (>=1 door, >=1 window). Compute door/window placement from the current preset.floorSize so scaling works for 8x8 through 14x14. Use small offsets/thickness to prevent z-fighting and ensure castShadow/receiveShadow are set appropriately."
        },
        {
          "path": "frontend/src/features/office/Office3DViewer.tsx",
          "operation": "modify",
          "description": "Replace the current floor/back-wall-only meshes with the new room shell component that renders walls + windows + door. Ensure it uses the existing preset and keeps OrbitControls behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Add an Office Decor customization section on the Office Management page and persist selections in the existing persisted office store.",
      "acceptanceCriteria": [
        "OfficePage includes a clearly labeled section (e.g., \"Office Decor\") with controls to select: wall finish (solid vs wallpaper) and floor wood style.",
        "Selections persist across page reloads via the existing office-storage persisted Zustand store (frontend/src/features/office/officeStore.ts).",
        "Defaults are sensible for new users (no empty/undefined material selections) and do not change existing office level progression behavior.",
        "User-facing labels for the decor controls are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/office/officeStore.ts",
          "operation": "modify",
          "description": "Extend the persisted Zustand store to include decor state (wall finish mode, selected wall color or wallpaper pattern, selected wood floor style) with sensible defaults. Keep existing level progression logic and upgrade cost behavior unchanged."
        },
        {
          "path": "frontend/src/features/office/OfficeDecorPanel.tsx",
          "operation": "create",
          "description": "Add an \"Office Decor\" UI panel that lets the user pick wall finish (solid vs wallpaper), pick a wall color or wallpaper pattern accordingly, and select a wood floor style. Use shadcn-ui components (e.g., Card/Select/Tabs/RadioGroup) to match existing UI patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/OfficePage.tsx",
          "operation": "modify",
          "description": "Wire the new OfficeDecorPanel into the Office Management page layout (alongside/near OfficeUpgradePanel) so users can change decor from this page. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}